# Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]


lst = list(map(int, input().split()))
lst_new = []
for i in range(len(lst) // 2):
    sum.append(lst[i] * lst[len(lst) - (i + 1)])
print(lst_new)